#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2019/3/3 11:06
# @Author  : owen
# @Site    :
# @File    : 2048_main.py
# @Software: PyCharm Community Edition
# @Code thought
#需求分析  ##########################################################################
# 1.初始化游戏
# 1.1.初始化棋盘
# 1.2.初始化棋子
# 1.3.存储棋盘 棋子
#
# 2.gaming
# 2.1.接受外部传入的指令
# 2.2.根据外部传入指定移动棋子
# 2.3.重新绘制棋盘
#
# 3.游戏结束
# 3.1.接受外部传入的指令
# 3.2.判断此时游戏是否胜利
# 3.3.根据游戏不同结束状态返回不同结果
#程序设计##########################################################################
# 1.有限状态机
